---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBottomDir1Generic
source: html/b27b6dcb-ea74-05ac-abb2-b9f41fd3cf51.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesBottomDir1Generic Property

"Bottom/Interior Major Number Of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemNumberOfLinesBottomDir1Generic { get; }
```